source/posts/org-capturing-live-jira-issues/index.org
#+title: Org-capturing live Jira Issues
#+date: [2022-05-08 Sun]
#+filetags: emacs

#+html_head_extra: <meta name="twitter:card" content="summary">
#+html_head_extra: <meta name="twitter:site" content="@fritzgrabo">
#+html_head_extra: <meta name="twitter:title" content="Org-capturing live Jira Issues">
#+html_head_extra: <meta name="twitter:description" content="Org-capture a live Jira issue with all its meta-data into an Org-mode heading.">
#+html_head_extra: <meta property="og:title" content="Org-capturing live Jira Issues">
#+html_head_extra: <meta property="og:description" content="Org-capture a live Jira issue with all its meta-data into an Org-mode heading.">

* Problem Statement

In my job, we use Atlassian Jira to manage and track our work.
The main thing I interact with in Jira are "issues" ("tickets" in other services):
I have a handful or two in flight at any given time.
When I work on issues, I take extensive notes on them in a single Org file that I maintain for my job.

I create a new Org TODO heading for an issue, and continue to work with that heading frequently enough to justify investing time into automating the heck out of it.

What I ended up with is a very lightweight integration of Org and Jira that helps with pulling an issue's metadata from Jira's API into an Org heading, and with keeping it current in there over time[fn:1].

In this post, I describe that surprisingly simple integration in detail.
My goal is to show how far one can go in Emacs with just a little customization effort, and to provide some useful insights in case you decide to experiment with any of this to streamline /your/ specific workflow, too.

* Orientation

- I start with a simple Org capture template that prompts for an issue key (aka "ticket number"), then stores that key in a new, otherwise empty TODO heading as a ~JiraIssueKey~ property, then immediately finishes the capture.


- Org mode offers a hook for processing the captured heading before it finalizes the capture.
  I add a function to that hook that pulls metadata for an issue key stored in the current heading from Jira's API, resets the heading's headline (its title) from it, and finally copies a bunch of the issue's details into the heading's properties.


- Doing all the heavy lifting in a separate function has the advantage that I can run that function anytime, on any heading with a ~JiraIssueKey~ property.
  I use that to update existing headings (individually or in bulk) whenever I need to.

* Capturing

If you've worked with [[https://orgmode.org/manual/Capture-templates.html][Org capture templates]] before, this one will read pretty straight forward.
It binds the ~i~ key to a template that prompts for the Jira issue key, then adds a new TODO heading with that property to ~~/work.org~ under the top-level "Issues" heading.
Note that I set the ~:immediate-finish~ flag, which means that capturing ends immediately after answering the prompt for the issue key.

#+begin_src elisp
(setq org-capture-templates
      '(("i" "Jira Issue" entry
         (file+headline "~/work.org" "Issues")
         "* TODO %^{JiraIssueKey}p"
         :jump-to-captured t
         :immediate-finish t
         :empty-lines-after 1)))
#+end_src

* Post-processing the captured heading

In the code block below, I add a custom function ~fg/jira-update-heading~ to the hook I mentioned before.
Org calls this function with point on the new TODO heading before it finalizes the capture.

#+begin_src elisp
(defun fg/jira-update-heading ()
  "Update heading for Jira Issue at point."
  (interactive)
  (when-let* ((pt (point))
              (issue-key (and (org-at-heading-p)
                              (org-entry-get pt "JIRAISSUEKEY"))))
    ;; TODO: Pull issue metadata, update headline and properties
    ))

(add-hook 'org-capture-before-finalize-hook #'fg/jira-update-heading)
#+end_src

Note that I declare this function as "interactive":
that way, I can manually invoke it as a command to pull the latest issue metadata for the heading at point whenever I need to.

Note also that Org runs the above hook for /every/ capture, not just the "Jira Issue" one.
The ~fg/jira-update-heading~ function accounts for this by silently ending early in case point is not on an Org heading with a ~JiraIssueKey~ property.

