docs/posts/org-capturing-live-jira-issues/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-capturing live Jira Issues</title>
<meta name="author" content="Fritz Grabo" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Cache-Control" content="no-store, no-cache, must-revalidate, max-age=0">
<meta http-equiv="Expires" content="0">
<meta http-equiv="Pragma" content="no-cache">
<!-- Stylesheets -->
<link rel="stylesheet" href="/styles/main.css" />
<!-- Scripts -->
<!-- Icons -->
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?">
<!-- Privacy-friendly analytics by Plausible -->
<meta name="twitter:card" content="summary">
<meta name="twitter:site" content="@fritzgrabo">
<meta name="twitter:title" content="Org-capturing live Jira Issues">
<meta name="twitter:description" content="Org-capture a live Jira issue with all its meta-data into an Org-mode heading.">
<meta name="og:title" content="Org-capturing live Jira Issues">
<meta name="og:description" content="Org-capture a live Jira issue with all its meta-data into an Org-mode heading.">
</head>
<body>
<div id="preamble" class="status">
<p>
  <a href="/">Fritz Grabo</a> /
  <a href="/#on-work">On Work</a> /
  <a href="/now/">Now</a> /
  <!--<a href="/past/">Past</a> /-->
  <a href="/posts/">Posts</a>
  <a href="/posts/rss.xml">(RSS)</a> /
  <a href="/contact/">Contact</a>
</p>
</div>
<div id="content" class="content">
<h1 class="title">Org-capturing live Jira Issues
<br />
<span class="subtitle">Published 2022-05-08</span>
</h1>
<section id="outline-container-problem-statement" class="outline-2">
<h2 id="problem-statement">Problem Statement</h2>
<div class="outline-text-2" id="text-problem-statement">
<p>
In my job, we use Atlassian Jira to manage and track our work.
The main thing I interact with in Jira are "issues" ("tickets" in other services):
I have a handful or two in flight at any given time.
When I work on issues, I take extensive notes on them in a single Org file that I maintain for my job.
</p>

<p>
I create a new Org TODO heading for an issue, and continue to work with that heading frequently enough to justify investing time into automating the heck out of it.
</p>

<p>
What I ended up with is a very lightweight integration of Org and Jira that helps with pulling an issue's metadata from Jira's API into an Org heading, and with keeping it current in there over time<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>

<p>
In this post, I describe that surprisingly simple integration in detail.
My goal is to show how far one can go in Emacs with just a little customization effort, and to provide some useful insights in case you decide to experiment with any of this to streamline <i>your</i> specific workflow, too.
</p>
</div>
</section>
<section id="outline-container-orientation" class="outline-2">
<h2 id="orientation">Orientation</h2>
<div class="outline-text-2" id="text-orientation">
<ul class="org-ul">
<li>I start with a simple Org capture template that prompts for an issue key (aka "ticket number"), then stores that key in a new, otherwise empty TODO heading as a <code>JiraIssueKey</code> property, then immediately finishes the capture.</li>
</ul>


<ul class="org-ul">
<li>Org mode offers a hook for processing the captured heading before it finalizes the capture.
I add a function to that hook that pulls metadata for an issue key stored in the current heading from Jira's API, resets the heading's headline (its title) from it, and finally copies a bunch of the issue's details into the heading's properties.</li>
</ul>


<ul class="org-ul">
<li>Doing all the heavy lifting in a separate function has the advantage that I can run that function anytime, on any heading with a <code>JiraIssueKey</code> property.
I use that to update existing headings (individually or in bulk) whenever I need to.</li>
</ul>
</div>
</section>
<section id="outline-container-capturing" class="outline-2">
<h2 id="capturing">Capturing</h2>
<div class="outline-text-2" id="text-capturing">
<p>
If you've worked with <a href="https://orgmode.org/manual/Capture-templates.html">Org capture templates</a> before, this one will read pretty straight forward.
It binds the <code>i</code> key to a template that prompts for the Jira issue key, then adds a new TODO heading with that property to <code>~/work.org</code> under the top-level "Issues" heading.
Note that I set the <code>:immediate-finish</code> flag, which means that capturing ends immediately after answering the prompt for the issue key.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #800080;">setq</span> org-capture-templates
      '((<span style="color: #8b2252;">"i"</span> <span style="color: #8b2252;">"Jira Issue"</span> entry
         (file+headline <span style="color: #8b2252;">"~/work.org"</span> <span style="color: #8b2252;">"Issues"</span>)
         <span style="color: #8b2252;">"* TODO %^{JiraIssueKey}p"</span>
         <span style="color: #483d8b;">:jump-to-captured</span> t
         <span style="color: #483d8b;">:immediate-finish</span> t
         <span style="color: #483d8b;">:empty-lines-after</span> 1)))
</pre>
</div>
</div>
</section>
<section id="outline-container-post-processing-the-captured-heading" class="outline-2">
<h2 id="post-processing-the-captured-heading">Post-processing the captured heading</h2>
<div class="outline-text-2" id="text-post-processing-the-captured-heading">
<p>
In the code block below, I add a custom function <code>fg/jira-update-heading</code> to the hook I mentioned before.
Org calls this function with point on the new TODO heading before it finalizes the capture.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #800080;">defun</span> <span style="color: #0000ff;">fg/jira-update-heading</span> ()
  <span style="color: #8b2252;">"Update heading for Jira Issue at point."</span>
  (<span style="color: #800080;">interactive</span>)
  (<span style="color: #800080;">when-let*</span> ((pt (point))
              (issue-key (<span style="color: #800080;">and</span> (org-at-heading-p)
                              (org-entry-get pt <span style="color: #8b2252;">"JIRAISSUEKEY"</span>))))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">TODO: Pull issue metadata, update headline and properties
</span>    ))

(add-hook 'org-capture-before-finalize-hook #'fg/jira-update-heading)
</pre>
</div>

<p>
Note that I declare this function as "interactive":
that way, I can manually invoke it as a command to pull the latest issue metadata for the heading at point whenever I need to.
</p>

<p>
Note also that Org runs the above hook for <i>every</i> capture, not just the "Jira Issue" one.
The <code>fg/jira-update-heading</code> function accounts for this by silently ending early in case point is not on an Org heading with a <code>JiraIssueKey</code> property.
</p>
</div>
</section>
