source/posts/org-capturing-live-jira-issues/index.org
* Pulling issue metadata

I use nyyManni's straightforward, dependable [[https://github.com/nyyManni/jiralib2][jiralib2]] package which provides "Jira REST API bindings to Emacs Lisp".
The package covers many parts of Jira's API actually, so you could use it to grab an issue's comments, update the issue, etc., too.
For my usecase, I'm only interested in fetching an issue's metadata ([[https://developer.atlassian.com/cloud/jira/platform/rest/v2/api-group-issues/#api-rest-api-2-issue-issueidorkey-get][API docs]]).

Setting up ~jiralib2~ is simple.
There are variables for the Jira host's URL, your username, and auth settings.
I decide to use the "token authentication" method and create an API token in my Jira Account's settings[fn:2].

With the exception of the API token (which I keep in a secure location), I set everything up using [[https://www.gnu.org/software/emacs/manual/html_node/emacs/File-Variables.html#File-Variables][local variables]] in the Org file to allow for varying settings in distinct Org files.
I add this to the end of ~~/work.org~[fn:3]:

#+begin_src org
# Local Variables:
# jiralib2-auth: token
# jiralib2-url: "https://example.atlassian.net"
# jiralib2-user-login-name: "fgrabo@example.com"
# End:
#+end_src

To test connectivity, I add this Org source block to pull an issue from Jira:

#+begin_src org
,#+begin_src elisp
(jiralib2-get-issue "PRJ-1234")
,#+end_src
#+end_src

Evaluating the block yields a data structure of nested [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html][association lists]]:

#+begin_src elisp
((key . "PRJ-1234")
 (fields
  (assignee
   (emailAddress . "fgrabo@example.com")
   (displayName . "Fritz Grabo"))
  (summary . "Fix typo in product logo")
  (description . "Actually, MegaCorp is spelled with a capital C")
  ;; Many, many more fields and details
  ))
#+end_src

The [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html#index-let_002dalist][Emacs ~let-alist~ macro]] provides an elegant way to dig up values from arbitrary paths in nested association lists.
Here's a quick example:

#+begin_src elisp
(let-alist (jiralib2-get-issue "PRJ-1234") .fields.assignee.displayName)
;; => Fritz Grabo
#+end_src

* Updating headline and properties

With all the above out of the way, the complete ~fg/jira-update-heading~ function should be straight-forward to read:

#+begin_src elisp
(defun fg/jira-update-heading ()
  "Update heading for Jira Issue at point."
  (interactive)
  (when-let* ((pt (point))
              (issue-key (and (org-at-heading-p)
                              (org-entry-get pt "JIRAISSUEKEY"))))
    (let-alist (jiralib2-get-issue issue-key)
      ;; Update headline
      (let ((headline (format "%s %s" .key .fields.summary)))
        (message "Updating %s" headline)
        (org-edit-headline headline))
      ;; Update properties
      (cl-loop
       for (property value)
       on (list
           "JiraAssignee" .fields.assignee.displayName
           "JiraCreated" .fields.created
           "JiraIssueKey" .key
           "JiraIssueType" .fields.issuetype.name
           "JiraPriority" .fields.priority.name
           "JiraProjectKey" .fields.project.key
           "JiraReporter" .fields.reporter.displayName
           "JiraStatus" .fields.status.name
           "JiraSummary" .fields.summary)
       by #'cddr
       do (org-entry-put pt property value)))))
#+end_src

Here's what the result of using the capture template for ~PRJ-1234~ looks like in the live Org file:

#+begin_src org
,* Issues
,** TODO PRJ-1234 Fix typo in product logo
   :PROPERTIES:
   :JiraIssueKey: PRJ-1234
   :JiraAssignee: Fritz Grabo
   :JiraCreated: 2022-05-08T10:49:56.963-0400
   :JiraIssueType: Task
   :JiraPriority: Blocker
   :JiraProjectKey: PRJ
   :JiraReporter: Elisabeth K.
   :JiraStatus: Ready
   :JiraSummary: Fix typo in product logo
   :END:
#+end_src

* Bulk-updating Jira issues in an Org file

The last piece of the puzzle is a command to update /all/ headings with a ~JiraIssueKey~ property in a buffer.
Fortunately, alphapapa's remarkably useful [[https://github.com/alphapapa/org-ql][org-ql]] package makes it dead easy to select all such headings and to run an arbitrary action on them:

#+begin_src elisp
(defvar fg/jira-heading-ql-query
  '(and (property "JiraIssueKey") (not (tags "ARCHIVE")))
  "Org-ql query to find headings for Jira issues.")

(defun fg/jira-update-headings ()
  "Update all headings for Jira issues in the current buffer."
  (interactive)
  (org-ql-select
    (current-buffer)
    fg/jira-heading-ql-query
    :action #'fg/jira-update-heading)
  (message "Done."))
#+end_src

Note that I filter out archived headings in the query.
That's because I keep archived issues under an "Archived Issues" heading in the same file, and I don't bother updating them once they're archived.
Note also that I pull the org-ql query out into a variable so I can override it using file-local variables if need be.

If you're so inclined, you could wire this function up to run on a timer, or when the file is modified.
Myself, I invoke the command manually whenever I want updated details.

To make this a little easier, I place an [[https://orgmode.org/manual/External-Links.html][external Org link]] to ~elisp:fg/jira-update-headings~ at the top of the file that runs the command when I click (or otherwise open) it.

