docs/posts/org-capturing-live-jira-issues/index.html
<section id="outline-container-pulling-issue-metadata" class="outline-2">
<h2 id="pulling-issue-metadata">Pulling issue metadata</h2>
<div class="outline-text-2" id="text-pulling-issue-metadata">
<p>
I use nyyManni's straightforward, dependable <a href="https://github.com/nyyManni/jiralib2">jiralib2</a> package which provides "Jira REST API bindings to Emacs Lisp".
The package covers many parts of Jira's API actually, so you could use it to grab an issue's comments, update the issue, etc., too.
For my usecase, I'm only interested in fetching an issue's metadata (<a href="https://developer.atlassian.com/cloud/jira/platform/rest/v2/api-group-issues/#api-rest-api-2-issue-issueidorkey-get">API docs</a>).
</p>

<p>
Setting up <code>jiralib2</code> is simple.
There are variables for the Jira host's URL, your username, and auth settings.
I decide to use the "token authentication" method and create an API token in my Jira Account's settings<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<p>
With the exception of the API token (which I keep in a secure location), I set everything up using <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/File-Variables.html#File-Variables">local variables</a> in the Org file to allow for varying settings in distinct Org files.
I add this to the end of <code>~/work.org</code><sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;"># Local Variables&#58;</span>
<span style="color: #b22222;"># jiralib2-auth: token</span>
<span style="color: #b22222;"># jiralib2-url: "<a href="https://example.atlassian.net">https://example.atlassian.net</a>"</span>
<span style="color: #b22222;"># jiralib2-user-login-name: "fgrabo@example.com"</span>
<span style="color: #b22222;"># End:</span>
</pre>
</div>

<p>
To test connectivity, I add this Org source block to pull an issue from Jira:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+begin_src elisp
</span>(jiralib2-get-issue <span style="color: #8b2252;">"PRJ-1234"</span>)
<span style="color: #b22222;">#+end_src</span>
</pre>
</div>

<p>
Evaluating the block yields a data structure of nested <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html">association lists</a>:
</p>

<div class="org-src-container">
<pre class="src src-elisp">((key . <span style="color: #8b2252;">"PRJ-1234"</span>)
 (fields
  (assignee
   (emailAddress . <span style="color: #8b2252;">"fgrabo@example.com"</span>)
   (displayName . <span style="color: #8b2252;">"Fritz Grabo"</span>))
  (summary . <span style="color: #8b2252;">"Fix typo in product logo"</span>)
  (description . <span style="color: #8b2252;">"Actually, MegaCorp is spelled with a capital C"</span>)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Many, many more fields and details
</span>  ))
</pre>
</div>

<p>
The <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html#index-let_002dalist">Emacs <code>let-alist</code> macro</a> provides an elegant way to dig up values from arbitrary paths in nested association lists.
Here's a quick example:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #800080;">let-alist</span> (jiralib2-get-issue <span style="color: #8b2252;">"PRJ-1234"</span>) .fields.assignee.displayName)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; Fritz Grabo</span>
</pre>
</div>
</div>
</section>
<section id="outline-container-updating-headline-and-properties" class="outline-2">
<h2 id="updating-headline-and-properties">Updating headline and properties</h2>
<div class="outline-text-2" id="text-updating-headline-and-properties">
<p>
With all the above out of the way, the complete <code>fg/jira-update-heading</code> function should be straight-forward to read:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #800080;">defun</span> <span style="color: #0000ff;">fg/jira-update-heading</span> ()
  <span style="color: #8b2252;">"Update heading for Jira Issue at point."</span>
  (<span style="color: #800080;">interactive</span>)
  (<span style="color: #800080;">when-let*</span> ((pt (point))
              (issue-key (<span style="color: #800080;">and</span> (org-at-heading-p)
                              (org-entry-get pt <span style="color: #8b2252;">"JIRAISSUEKEY"</span>))))
    (<span style="color: #800080;">let-alist</span> (jiralib2-get-issue issue-key)
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Update headline
</span>      (<span style="color: #800080;">let</span> ((headline (format <span style="color: #8b2252;">"%s %s"</span> .key .fields.summary)))
        (message <span style="color: #8b2252;">"Updating %s"</span> headline)
        (org-edit-headline headline))
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Update properties
</span>      (<span style="color: #800080;">cl-loop</span>
       for (property value)
       on (list
           <span style="color: #8b2252;">"JiraAssignee"</span> .fields.assignee.displayName
           <span style="color: #8b2252;">"JiraCreated"</span> .fields.created
           <span style="color: #8b2252;">"JiraIssueKey"</span> .key
           <span style="color: #8b2252;">"JiraIssueType"</span> .fields.issuetype.name
           <span style="color: #8b2252;">"JiraPriority"</span> .fields.priority.name
           <span style="color: #8b2252;">"JiraProjectKey"</span> .fields.project.key
           <span style="color: #8b2252;">"JiraReporter"</span> .fields.reporter.displayName
           <span style="color: #8b2252;">"JiraStatus"</span> .fields.status.name
           <span style="color: #8b2252;">"JiraSummary"</span> .fields.summary)
       by #'cddr
       do (org-entry-put pt property value)))))
</pre>
</div>

<p>
Here's what the result of using the capture template for <code>PRJ-1234</code> looks like in the live Org file:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #0000ff; font-weight: bold;">* Issues</span>
<span style="color: #a0522d; font-weight: bold;">** </span><span style="color: #e00033; font-weight: bold;">TODO</span><span style="color: #a0522d; font-weight: bold;"> PRJ-1234 Fix typo in product logo</span>
   <span style="color: #0000ff;">:PROPERTIES:</span>
   <span style="color: #800080;">:JiraIssueKey:</span> <span style="color: #193f8f;">PRJ-1234</span>
   <span style="color: #800080;">:JiraAssignee:</span> <span style="color: #193f8f;">Fritz Grabo</span>
   <span style="color: #800080;">:JiraCreated:</span> <span style="color: #193f8f;">2022-05-08T10:49:56.963-0400</span>
   <span style="color: #800080;">:JiraIssueType:</span> <span style="color: #193f8f;">Task</span>
   <span style="color: #800080;">:JiraPriority:</span> <span style="color: #193f8f;">Blocker</span>
   <span style="color: #800080;">:JiraProjectKey:</span> <span style="color: #193f8f;">PRJ</span>
   <span style="color: #800080;">:JiraReporter:</span> <span style="color: #193f8f;">Elisabeth K.</span>
   <span style="color: #800080;">:JiraStatus:</span> <span style="color: #193f8f;">Ready</span>
   <span style="color: #800080;">:JiraSummary:</span> <span style="color: #193f8f;">Fix typo in product logo</span>
   <span style="color: #0000ff;">:END:</span>
</pre>
</div>
</div>
</section>
<section id="outline-container-bulk-updating-jira-issues-in-an-org-file" class="outline-2">
<h2 id="bulk-updating-jira-issues-in-an-org-file">Bulk-updating Jira issues in an Org file</h2>
<div class="outline-text-2" id="text-bulk-updating-jira-issues-in-an-org-file">
<p>
The last piece of the puzzle is a command to update <i>all</i> headings with a <code>JiraIssueKey</code> property in a buffer.
Fortunately, alphapapa's remarkably useful <a href="https://github.com/alphapapa/org-ql">org-ql</a> package makes it dead easy to select all such headings and to run an arbitrary action on them:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #800080;">defvar</span> <span style="color: #a0522d;">fg/jira-heading-ql-query</span>
  '(and (property <span style="color: #8b2252;">"JiraIssueKey"</span>) (not (tags <span style="color: #8b2252;">"ARCHIVE"</span>)))
  <span style="color: #8b2252;">"Org-ql query to find headings for Jira issues."</span>)

(<span style="color: #800080;">defun</span> <span style="color: #0000ff;">fg/jira-update-headings</span> ()
  <span style="color: #8b2252;">"Update all headings for Jira issues in the current buffer."</span>
  (<span style="color: #800080;">interactive</span>)
  (org-ql-select
    (current-buffer)
    fg/jira-heading-ql-query
    <span style="color: #483d8b;">:action</span> #'fg/jira-update-heading)
  (message <span style="color: #8b2252;">"Done."</span>))
</pre>
</div>

<p>
Note that I filter out archived headings in the query.
That's because I keep archived issues under an "Archived Issues" heading in the same file, and I don't bother updating them once they're archived.
Note also that I pull the org-ql query out into a variable so I can override it using file-local variables if need be.
</p>

<p>
If you're so inclined, you could wire this function up to run on a timer, or when the file is modified.
Myself, I invoke the command manually whenever I want updated details.
</p>

<p>
To make this a little easier, I place an <a href="https://orgmode.org/manual/External-Links.html">external Org link</a> to <code>elisp:fg/jira-update-headings</code> at the top of the file that runs the command when I click (or otherwise open) it.
</p>
</div>
</section>
