source/posts/org-capturing-live-jira-issues/index.org
* Taking this further

With such easy means to add Jira issue details into an Org file, it's hard not to be tempted to /do something/ with all that data.

Ideas include:

- Defer the heading's TODO status from the issue's status[fn:4].
- Fetch all the issues of the current sprint using ~jiralib2-jql-search~, use a [[https://orgmode.org/manual/Capturing-column-view.html#index-BEGIN-columnview][capturing column-view]] to render a quick dashboard.
- Fetch like above, but use [[https://github.com/alphapapa/org-ql][org-ql]], [[https://github.com/fritzgrabo/ob-dsq][ob-dsq]] and [[https://github.com/fritzgrabo/ob-dsq/tree/main/examples#dynamically-generated-tabular-data][SQL queries to create reports]] like "story points left in sprint per assignee", etc. from Org heading properties.
- Use minad's wonderful [[https://github.com/minad/tempel][tempel]] package to expand the mention of an issue key into its <key and title>.

* Closing thoughts

I am stunned to see how little code it takes to achive such a drastic impact on my daily work.
"Such are the powers of the extensible, customizable text editor", I guess, and the possibilities that come with it.

I'm grateful to the authors and maintainers of Org mode, jiralib2 and org-ql, because really, I am just adding trivial glue code here to integrate packages that are showcases of good craftsmanship and that are built with extensibility in mind.

Finally, if you find any of this useful or have ideas on how to make it better, I'd love to [[https://www.reddit.com/r/emacs/comments/ulaswe/blog_post_orgcapturing_live_jira_issues/][hear from you]]. Thanks!

[fn:1] If you're looking for a more apt integration with Jira, do check out the popular [[https://github.com/nyyManni/ejira][Ejira]] and [[https://github.com/ahungry/org-jira][org-jira]] packages, both of which come with an impressive list of features.

[fn:2] Go to https://id.atlassian.com, Account Settings, Security, Create and manage API tokens, Create API token.

[fn:3] If you follow along, note that you'll need to kill the buffer and revisit the file to apply these variables.

[fn:4] For example, I could set the heading's todo status to DONE when the issue's status moves to "In Production".
In my workflow, though, I noticed that there's enough exceptions to the rule that automating this doesn't work for me.
For instance, I often mark a heading DONE as soon as its issue goes to the release queue, but before it's "In Production".
At the same time, I sometimes want to keep the heading in PROGRESS even after its issue moved to "In Production" because I want to verify an assumption after deploying to production before I close it out.
