docs/posts/org-capturing-live-jira-issues/index.html
<section id="outline-container-taking-this-further" class="outline-2">
<h2 id="taking-this-further">Taking this further</h2>
<div class="outline-text-2" id="text-taking-this-further">
<p>
With such easy means to add Jira issue details into an Org file, it's hard not to be tempted to <i>do something</i> with all that data.
</p>

<p>
Ideas include:
</p>

<ul class="org-ul">
<li>Defer the heading's TODO status from the issue's status<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>.</li>
<li>Fetch all the issues of the current sprint using <code>jiralib2-jql-search</code>, use a <a href="https://orgmode.org/manual/Capturing-column-view.html#index-BEGIN-columnview">capturing column-view</a> to render a quick dashboard.</li>
<li>Fetch like above, but use <a href="https://github.com/alphapapa/org-ql">org-ql</a>, <a href="https://github.com/fritzgrabo/ob-dsq">ob-dsq</a> and <a href="https://github.com/fritzgrabo/ob-dsq/tree/main/examples#dynamically-generated-tabular-data">SQL queries to create reports</a> like "story points left in sprint per assignee", etc. from Org heading properties.</li>
<li>Use minad's wonderful <a href="https://github.com/minad/tempel">tempel</a> package to expand the mention of an issue key into its &lt;key and title&gt;.</li>
</ul>
</div>
</section>
<section id="outline-container-closing-thoughts" class="outline-2">
<h2 id="closing-thoughts">Closing thoughts</h2>
<div class="outline-text-2" id="text-closing-thoughts">
<p>
I am stunned to see how little code it takes to achive such a drastic impact on my daily work.
"Such are the powers of the extensible, customizable text editor", I guess, and the possibilities that come with it.
</p>

<p>
I'm grateful to the authors and maintainers of Org mode, jiralib2 and org-ql, because really, I am just adding trivial glue code here to integrate packages that are showcases of good craftsmanship and that are built with extensibility in mind.
</p>

<p>
Finally, if you find any of this useful or have ideas on how to make it better, I'd love to <a href="https://www.reddit.com/r/emacs/comments/ulaswe/blog_post_orgcapturing_live_jira_issues/">hear from you</a>. Thanks!
</p>
</div>
</section>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
If you're looking for a more apt integration with Jira, do check out the popular <a href="https://github.com/nyyManni/ejira">Ejira</a> and <a href="https://github.com/ahungry/org-jira">org-jira</a> packages, both of which come with an impressive list of features.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Go to <a href="https://id.atlassian.com">https://id.atlassian.com</a>, Account Settings, Security, Create and manage API tokens, Create API token.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
If you follow along, note that you'll need to kill the buffer and revisit the file to apply these variables.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For example, I could set the heading's todo status to DONE when the issue's status moves to "In Production".
In my workflow, though, I noticed that there's enough exceptions to the rule that automating this doesn't work for me.
For instance, I often mark a heading DONE as soon as its issue goes to the release queue, but before it's "In Production".
At the same time, I sometimes want to keep the heading in PROGRESS even after its issue moved to "In Production" because I want to verify an assumption after deploying to production before I close it out.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p>Published 2022-05-08, last modified 2022-05-08.</p>
<p>
  All original content is licensed under a custom <a href="/license/">license</a>.
</p>
</div>
</body>
</html>
